app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["created_at", "2015-05-26 13:32:36.063815"], ["title", "test"], ["updated_at", "2015-05-26 13:32:36.063815"], ["user_id", 1]]